{
    "navbar": {
        "about": "Về tôi",
        "skills": "Kỹ năng",
        "projects": "Dự án",
        "resume": "Tóm tắt",
        "contact": "Liên hệ",
        "Hire Me": "Tuyển dụng tôi"
    },

    "intro": {
        "name": "Phan Hoàng Tuấn",
        "bio": "Xin chào, tôi là Tuấn - Fresher PHP Laravel Developer. Chào mừng bạn đến với trang web của tôi.",
        "viewPortfolio": "Xem dự án",
        "downloadCV": "Tải CV"
    },

    "about": {
        "name": "Phan Hoàng Tuấn",
        "bio": "Tôi là một lập trình viên PHP, tập trung phát triển backend với Laravel, MySQL và API RESTful. Tôi yêu thích việc xây dựng các ứng dụng web có khả năng mở rộng và viết mã sạch, dễ bảo trì. Luôn mong muốn học hỏi công nghệ mới và đóng góp vào những dự án ý nghĩa. Mục tiêu của tôi là phát triển trở thành một kỹ sư backend toàn diện."
    },

    "skills": {
        "title": "Những gì tôi làm",
        "tech": "Tôi có hơn 6 tháng kinh nghiệm thực tập thực tế tại các công ty startup tập trung vào PHP Laravel, API RESTful và MySQL. Dưới đây là tổng quan nhanh về bộ kỹ năng và công nghệ chính mà tôi sử dụng. Bạn muốn tìm hiểu thêm về kinh nghiệm của tôi? Xem chi tiết "
    },

    "projects": {
        "title": "Dự án nổi bật",
        "viewDetail": "Xem chi tiết"
    },

    "resume": {
        "title": "Tóm tắt",
        "education": "Học vấn",
        "experience": "Kinh nghiệm chuyên môn",
        "educationList": [
            {
                "degree": "Cử nhân Công nghệ thông tin",
                "duration": "9/2022 - 5/2025",
                "school": "Trường Cao đẳng FPT Polytechnic",
                "major": "Ngành: Công nghệ thông tin",
                "specialization": "Chuyên ngành: Lập trình Web Backend"
            }
        ],
        "courseList": [
            {
                "title": "Khóa học JavaScript - Udemy (by Jonas Schmedtmann)",
                "duration": "1/2024 - 2/2024",
                "points": [
                    "Học từ cơ bản đến nâng cao về JavaScript: biến, function, array, object, DOM.",
                    "Làm việc với asynchronous JS (Promise, async/await, fetch API).",
                    "Hiểu và ứng dụng OOP trong JavaScript (constructor, class, inheritance).",
                    "Thực hành qua nhiều mini project và bài tập thực tế."
                ]
            }
        ],
        "experienceList": [
            {
                "position": "Thực tập sinh lập trình PHP (Laravel)",
                "duration": "3/2025 - 6/2025",
                "company": "CÔNG TY CP ĐÀO TẠO TRỰC TUYẾN OES",
                "tasks": [
                    "Tối ưu backend cho hệ thống khóa học và quản trị nội bộ bằng Laravel API.",
                    "Làm quen với PostgreSQL, tối ưu hóa truy vấn data.",
                    "Test API với Postman, phát hiện và xử lý 50% lỗi logic từ phản hồi của Tester.",
                    "Đề xuất và triển khai giao diện người dùng cho module kéo-thả khóa học sử dụng VueJS, giảm thời gian phản hồi và tối ưu trải nghiệm người dùng.",
                    "Quản lý mã nguồn với GitHub, GitLab, đảm bảo tiến độ công việc nhóm."
                ]
            },
            {
                "position":"Thực tập sinh lập trình PHP (Laravel)",
                "duration":"9/2024 - 12/2024",
                "company":"Công ty cổ phần IMTA",
                "tasks":[
                    "Tham gia làm việc nhóm, thiết kế giao diện và luồng hoạt động cho dự án website bán trà theo hướng dẫn từ Leader.",
                    "Thiết kế giao diện người dùng bằng Blade Template, Bootstrap, jQuery, tối ưu trải nghiệm người dùng.",
                    "Sử dụng GitHub, Docker để quản lý mã nguồn và môi rường phát triển, tăng hiệu quả làm việc nhóm 20-30%.",
                    "Nghiên cứu thêm về AI Prompt Engineering theo yêu cầu công ty, hỗ trợ cải thiện chức năng AI hệ thống."
                ]
            }
        ]
    },

    "contact": {
        "title": "Liên hệ",
        "desc1": "Bạn có thắc mắc hoặc chỉ muốn chào hỏi? Hãy để lại tin nhắn bên dưới hoặc gửi email cho tôi theo địa chỉ ",
        "desc2": "Bạn muốn kết nối? Truy cập vào các kênh xã hội dưới đây để kết nối với tôi.",
        "formTitle": "Liên hệ với tôi",
        "formName": "Tên",
        "formEmail": "Email",
        "formMessage": "Nhập nội dung của bạn",
        "formSubmit": "Gửi ngay"
    },

    "footer": {
        "copyright": " Phan Hoàng Tuấn. Đã tùy biến từ giao diện DevCard của "
    }
}